In [1]:
import pandas as pd

In [3]:
dados = {
            'emprego': ['dba', 'programador','arquiteto_redes'],
            'nova_jersey': [97350, 82000, 112840],
            'florida': [ 77140, 71540, 62310]
        }

In [4]:
type(dados)

dict

In [6]:
dataset = pd.DataFrame(dados)

In [7]:
dataset.head()

           emprego  nova_jersey  florida
0              dba        97350    77140
1      programador        82000    71540
2  arquiteto_redes       112840    62310

In [8]:
dataset['nova_jersey'].sum()

292190

In [9]:
dataset['florida'].sum()

210990

In [12]:
dataset['%_nova_jersey'] = dataset['nova_jersey'] / dataset['nova_jersey'].sum()

In [14]:
dataset['%_florida'] = dataset['florida'] / dataset['florida'].sum()

In [15]:
dataset

           emprego  nova_jersey  florida  %_nova_jersey  %_florida
0              dba        97350    77140       0.333174   0.365610
1      programador        82000    71540       0.280639   0.339068
2  arquiteto_redes       112840    62310       0.386187   0.295322